Public Attributes | List of all members
API_Elem_Head Struct Reference
Element Manager API
General element header for element types. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_ElemType  | type
The type of the element.
API_Guid  | guid
The globally unique identifier of the element. It is type-independent, and guaranteed to be globally unique in all projects. (The only possible guid clash is between projects which have evolved from the same base project.) Also, it doesn't change under any circumstances.
UInt64  | modiStamp
The modification stamp of the element.
API_Guid  | groupGuid
The identifier of the group the element belongs to. APINULLGuid means the element is not grouped. Doesn't apply to certain (non-groupable) element types.
API_Guid  | hotlinkGuid
The identifier of the hotlink instance the element belongs to (see API_HotlinkType). APINULLGuid means the element is not part of any hotlinks.
short  | floorInd
The element belongs to this floor.
API_AttributeIndex  | layer
The layer attribute index of the element.
bool  | hasMemo
Tells whether an element has extended information (memo) attached.
char  | drwIndex
The index of the element in drawing order. It is important for bring to front/send to back type operations. Elements with higher drwIndex are drawn last.
short  | userId
The member ID of the owner in TeamWork mode.
short  | lockId
The member ID of the locker in TeamWork mode, bool in normal mode.
API_AttributeIndex  | rgr_layer
Reference group layer (-1: special/locked group).
API_RenovationStatusType  | renovationStatus
Renovation status of the element.
API_Guid  | renovationFilterGuid
Renovation filter GUID for the element. If set, the element's visibility is determined by the given renovation filter. No special filter set when its value APIUndefinedGuid ; APINULLGuid means that the renovation filter cannot be determined at the time of the query.
Detailed Description
General element header for element types.
Since
Archicad 26
Remarks
From version 12 the element refers to the containing group by the Guid of the group element. The m_groupId field has been eliminated, the top level group can be obtained with the ACAPI_Grouping_GetMainGroupGuid goody function. From version 18 the index -based identification is not available any more; please use GUIDs. From version 26 the typeID and variationID members were merged into an API_ElemType structure.
Member Data Documentation
◆ drwIndex
 API_Elem_Head::drwIndex
The index of the element in drawing order. It is important for bring to front/send to back type operations. Elements with higher drwIndex are drawn last.
◆ floorInd
 API_Elem_Head::floorInd
The element belongs to this floor.
◆ groupGuid
 API_Elem_Head::groupGuid
The identifier of the group the element belongs to. APINULLGuid means the element is not grouped. Doesn't apply to certain (non-groupable) element types.
◆ guid
 API_Elem_Head::guid
The globally unique identifier of the element. It is type-independent, and guaranteed to be globally unique in all projects. (The only possible guid clash is between projects which have evolved from the same base project.) Also, it doesn't change under any circumstances.
◆ hasMemo
 API_Elem_Head::hasMemo
Tells whether an element has extended information (memo) attached.
◆ hotlinkGuid
 API_Elem_Head::hotlinkGuid
The identifier of the hotlink instance the element belongs to (see API_HotlinkType). APINULLGuid means the element is not part of any hotlinks.
◆ layer
 API_Elem_Head::layer
The layer attribute index of the element.
◆ lockId
 API_Elem_Head::lockId
The member ID of the locker in TeamWork mode, bool in normal mode.
◆ modiStamp
 API_Elem_Head::modiStamp
The modification stamp of the element.
◆ renovationFilterGuid
 API_Elem_Head::renovationFilterGuid
Renovation filter GUID for the element. If set, the element's visibility is determined by the given renovation filter. No special filter set when its value APIUndefinedGuid ; APINULLGuid means that the renovation filter cannot be determined at the time of the query.
◆ renovationStatus
 API_Elem_Head::renovationStatus
Renovation status of the element.
◆ rgr_layer
 API_Elem_Head::rgr_layer
Reference group layer (-1: special/locked group).
◆ type
 API_Elem_Head::type
The type of the element.
◆ userId
 API_Elem_Head::userId
The member ID of the owner in TeamWork mode.